notes/2.3-linear-algebra.org
#+PROPERTY: header-args    :tangle src/clj_d2l/linear_algebra.clj
* Linear Algebra

Now that you can store and manipulate data, let us briefly review the
subset of basic linear algebra that you will need to understand and
implement most of models covered in this book. Below, we introduce the
basic mathematical objects, arithmetic, and operations in linear
algebra, expressing each of them through mathematical notation and the
corresponding implementation in code.

#+begin_src clojure :results silent :exports both :eval no-export
(ns clj-d2l.linear-algebra
  (:require [clj-djl.ndarray :as nd]
            [clj-d2l.core :as d2l]
            [clojure.java.io :as io]))
#+end_src

** Scalars

If you never studied linear algebra or machine learning, then your
past experience with math probably consisted of thinking about one
number at a time. And, if you ever balanced a checkbook or even paid
for dinner at a restaurant then you already know how to do basic
things like adding and multiplying pairs of numbers. For example, the
temperature in Palo Alto is $52$ degrees Fahrenheit. Formally, we call
values consisting of just one numerical quantity scalars. If you
wanted to convert this value to Celsius (the metric system's more
sensible temperature scale), you would evaluate the expression
$c=\frac{5}{9}(f−32)$, setting $f$ to $52$. In this equation, each of
the terms — $5$, $9$, and $32$ — are scalar values. The placeholders
$c$ and $f$ are called variables and they represent unknown scalar
values. We denote the space of all (continuous) real-valued scalars by
$\mathbb{R}$.

In this book, we adopt the mathematical notation where scalar
variables are denoted by ordinary lower-cased letters (e.g., $x$, $y$,
and $z$). For expedience, we will punt on rigorous definitions of what
precisely *space* is, but just remember for now that the expression $x
\in \mathbb{R}$ is a formal way to say that $x$ is a real-valued
scalar. The symbol $\in$ can be pronounced "in" and simply denotes
membership in a set. Analogously, we could write $x, y \in \{0,1\}$ to
state that $x$ and $y$ are numbers whose value can only be $0$ or $1$.

A scalar is represented by a NDArray with just one element. In the
next snippet, we instantiate two scalars and perform some familiar
arithmetic operations with them, namely addition, multiplication,
division, and exponentiation.

#+begin_src clojure :results silent :exports both :eval no-export
(def ndm (nd/base-manager))
(def x (nd/create ndm 3.))
(def y (nd/create ndm 2.))
#+end_src

#+begin_src clojure :results pp :exports both :eval no-export
(nd/+ x y)
#+end_src

#+RESULTS:
: ND: () cpu() float64
: 5.

#+begin_src clojure :results pp :exports both :eval no-export
(nd/* x y)
#+end_src

#+RESULTS:
: ND: () cpu() float64
: 6.

#+begin_src clojure :results pp :exports both :eval no-export
(nd// x y)
#+end_src

#+RESULTS:
: ND: () cpu() float64
: 1.5

#+begin_src clojure :results pp :exports both :eval no-export
(nd/pow x y)
#+end_src

#+RESULTS:
: ND: () cpu() float64
: 9.

**  Vectors

You can think of a vector as simply a list of scalar values. We call
these values the elements (entries or components) of the vector. When
our vectors represent examples from our dataset, their values hold
some real-world significance. For example, if we were training a model
to predict the risk that a loan defaults, we might associate each
applicant with a vector whose components correspond to their income,
length of employment, number of previous defaults, and other
factors. If we were studying the risk of heart attacks hospital
patients potentially face, we might represent each patient by a vector
whose components capture their most recent vital signs, cholesterol
levels, minutes of exercise per day, etc. In math notation, we will
usually denote vectors as bold-faced, lower-cased letters (e.g.,
$\mathbf{x}$, $\mathbf{y}$, and $\mathbf{z}$.

We work with vectors via one-dimensional NDArrays. In general NDArrays
can have arbitrary lengths, subject to the memory limits of your
machine.

#+begin_src clojure :results pp :exports both :eval no-export
(def x (nd/arange ndm 4.))
x
#+end_src

#+RESULTS:
: ND: (4) cpu() float32
: [0., 1., 2., 3.]

We can refer to any element of a vector by using a subscript. For
example, we can refer to the ith element of $\mathbf{x}$ by
$x_i$. Note that the element $x_i$ is a scalar, so we do not bold-face
the font when referring to it. Extensive literature considers column
vectors to be the default orientation of vectors, so does this
book. In math, a vector $\mathbf{x}$ can be written as

\begin{equation}
\mathbf{x} =  \begin{bmatrix} x_1 \\ x_2 \\ \vdots \\ x_n \end{bmatrix},
\end{equation}


where :math: $x_1, \ldots, x_n$ are elements of the vector. In code,
we access any element by indexing into the NDArray.


#+begin_src clojure :results pp :exports both :eval no-export
(nd/get x 3)
#+end_src

#+RESULTS:
: ND: () cpu() float32
: 3.

