docs/2.3-linear-algebra.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-17 Tue 07:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Kimi Ma" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="css/style.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="sitemap.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org688e275">1. Linear Algebra</a>
<ul>
<li><a href="#org05a3040">1.1. Scalars</a></li>
<li><a href="#org8c5b9ca">1.2. Vectors</a></li>
<li><a href="#org9c9b160">1.3. Length, Dimensionality, and Shape</a></li>
<li><a href="#orgeed1b80">1.4. Matrices</a></li>
<li><a href="#org988f23b">1.5. Tensors / NDArrays</a></li>
<li><a href="#org2aebf18">1.6. Basic Properties of Tensor Arithmetic</a></li>
<li><a href="#lin-alg-reduction">1.7. Reduction</a>
<ul>
<li><a href="#lin-alg-non-reduction">1.7.1. Non-Reduction Sum</a></li>
</ul>
</li>
<li><a href="#org8b72aeb">1.8. Dot Products</a></li>
<li><a href="#org069ddea">1.9. Matrix-Vector Products</a></li>
<li><a href="#org179830c">1.10. Matrix-Matrix Multiplication</a></li>
<li><a href="#org01d1f21">1.11. Norms</a></li>
<li><a href="#org5fbc90e">1.12. Norms and Objectives</a></li>
<li><a href="#org0f3a939">1.13. More on Linear Algebra</a></li>
<li><a href="#org3769a94">1.14. Summary</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org688e275" class="outline-2">
<h2 id="org688e275"><span class="section-number-2">1.</span> Linear Algebra</h2>
<div class="outline-text-2" id="text-1">
<p>
Now that you can store and manipulate data, let us briefly review the
subset of basic linear algebra that you will need to understand and
implement most of models covered in this book. Below, we introduce the
basic mathematical objects, arithmetic, and operations in linear
algebra, expressing each of them through mathematical notation and the
corresponding implementation in code.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">ns</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">clj-d2l.linear-algebra</span>
  <span style="color: #7388d6;">(</span><span style="color: #110099;">:require</span> <span style="color: #909183;">[</span>clj-djl.ndarray <span style="color: #110099;">:as</span> nd<span style="color: #909183;">]</span>
            <span style="color: #909183;">[</span>clj-d2l.core <span style="color: #110099;">:as</span> d2l<span style="color: #909183;">]</span>
            <span style="color: #909183;">[</span>clojure.java.io <span style="color: #110099;">:as</span> io<span style="color: #909183;">]</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>

<div id="outline-container-org05a3040" class="outline-3">
<h3 id="org05a3040"><span class="section-number-3">1.1.</span> Scalars</h3>
<div class="outline-text-3" id="text-1-1">
<p>
If you never studied linear algebra or machine learning, then your
past experience with math probably consisted of thinking about one
number at a time. And, if you ever balanced a checkbook or even paid
for dinner at a restaurant then you already know how to do basic
things like adding and multiplying pairs of numbers. For example, the
temperature in Palo Alto is \(52\) degrees Fahrenheit. Formally, we call
values consisting of just one numerical quantity <i>scalars</i>. If you
wanted to convert this value to Celsius (the metric system&rsquo;s more
sensible temperature scale), you would evaluate the expression
\(c=\frac{5}{9}(f−32)\), setting \(f\) to \(52\). In this equation, each of
the terms — \(5\), \(9\), and \(32\) — are scalar values. The placeholders
\(c\) and \(f\) are called <i>variables</i> and they represent unknown scalar
values. We denote the space of all (continuous) real-valued scalars by
\(\mathbb{R}\).
</p>

<p>
In this book, we adopt the mathematical notation where scalar
variables are denoted by ordinary lower-cased letters (e.g., \(x\), \(y\),
and \(z\)). For expedience, we will punt on rigorous definitions of what
precisely <b>space</b> is, but just remember for now that the expression \(x
\in \mathbb{R}\) is a formal way to say that \(x\) is a <i>real-valued
scalar</i>. The symbol \(\in\) can be pronounced &ldquo;in&rdquo; and simply denotes
membership in a set. Analogously, we could write \(x, y \in \{0,1\}\) to
state that \(x\) and \(y\) are numbers whose value can only be \(0\) or \(1\).
</p>

<p>
A scalar is represented by a NDArray with just one element. In the
next snippet, we instantiate two scalars and perform some familiar
arithmetic operations with them, namely addition, multiplication,
division, and exponentiation.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">def</span> <span style="color: #000000;">ndm</span> <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/base-manager<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">def</span> <span style="color: #000000;">x</span> <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/create ndm 3.<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">def</span> <span style="color: #000000;">y</span> <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/create ndm 2.<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/+ x y<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
ND: () cpu() float64
5.
</pre>


<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/* x y<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
ND: () cpu() float64
6.
</pre>


<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>// x y<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
ND: () cpu() float64
1.5
</pre>


<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/pow x y<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
ND: () cpu() float64
9.
</pre>
</div>
</div>

<div id="outline-container-org8c5b9ca" class="outline-3">
<h3 id="org8c5b9ca"><span class="section-number-3">1.2.</span> Vectors</h3>
<div class="outline-text-3" id="text-1-2">
<p>
You can think of a vector as simply a list of scalar values. We call
these values the <i>elements</i> (<i>entries</i> or <i>components</i>) of the vector. When
our vectors represent examples from our dataset, their values hold
some real-world significance. For example, if we were training a model
to predict the risk that a loan defaults, we might associate each
applicant with a vector whose components correspond to their income,
length of employment, number of previous defaults, and other
factors. If we were studying the risk of heart attacks hospital
patients potentially face, we might represent each patient by a vector
whose components capture their most recent vital signs, cholesterol
levels, minutes of exercise per day, etc. In math notation, we will
usually denote vectors as bold-faced, lower-cased letters (e.g.,
\(\mathbf{x}\), \(\mathbf{y}\), and \(\mathbf{z}\).
</p>

<p>
We work with vectors via one-dimensional NDArrays. In general NDArrays
can have arbitrary lengths, subject to the memory limits of your
machine.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">def</span> <span style="color: #000000;">x</span> <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/arange ndm 4.<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
x
</pre>
</div>

<pre class="example">
ND: (4) cpu() float32
[0., 1., 2., 3.]
</pre>


<p>
We can refer to any element of a vector by using a subscript. For
example, we can refer to the i<sup>th</sup> element of \(\mathbf{x}\) by
\(x_i\). Note that the element \(x_i\) is a scalar, so we do not bold-face
the font when referring to it. Extensive literature considers column
vectors to be the default orientation of vectors, so does this
book. In math, a vector \(\mathbf{x}\) can be written as
</p>

\begin{equation}
\mathbf{x} =  \begin{bmatrix} x_1 \\ x_2 \\ \vdots \\ x_n \end{bmatrix},
\end{equation}


<p>
where \(x_1, \ldots, x_n\) are elements of the vector. In code, we
access any element by indexing into the NDArray.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/<span style="color: #7F0055; font-weight: bold;">get</span> x 3<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
ND: () cpu() float32
3.
</pre>
</div>
</div>
