notes/2.3-linear-algebra.org
** Length, Dimensionality, and Shape


Let us revisit some concepts from Section 2.1. A vector is just an
array of numbers. And just as every array has a length, so does every
vector. In math notation, if we want to say that a vector $\mathbf{x}$
consists of $n$ real-valued scalars, we can express this as
$\mathbf{x} \in \mathbb{R}^n$. The length of a vector is commonly
called the *dimension* of the vector.

As with an ordinary Java array, we can access the length. In the case
of a NDArray we can achieve this by using the ~(size ndarray 0)~ function.


#+begin_src clojure :results pp :exports both
(nd/size x)
#+end_src

#+RESULTS:
: 4

When a NDArray represents a vector (with precisely one axis), we can
also access its length via the getShape() function. The shape lists
the length (dimensionality) along each axis of the NDArray. For
NDArrays with just one axis, the shape has just one element.

#+begin_src clojure :results pp :exports both :eval no-export
(nd/shape x)
#+end_src

#+RESULTS:
: (4)

Note that the word "dimension" tends to get overloaded in these
contexts and this tends to confuse people. To clarify, we use the
dimensionality of a vector or an axis to refer to its length, i.e.,
the number of elements of a vector or an axis. However, we use the
dimensionality of a NDArray to refer to the number of axes that a
NDArray has. In this sense, the dimensionality of some axis of a
NDArray will be the length of that axis.

** Matrices

Just as vectors generalize scalars from order zero to order one,
matrices generalize vectors from order one to order two. Matrices,
which we will typically denote with bold-faced, capital letters (e.g.,
$\mathbf{X}$, $\mathbf{Y}$, and $\mathbf{Z}$), are represented in code
as NDArray with two axes.

In math notation, we use $\mathbf{A} \in \mathbb{R}^{m \times n}$ to
express that the matrix $\mathbf{A}$ consists of $m$ rows and $n$
columns of real-valued scalars. Visually, we can illustrate any matrix
$\mathbf{A} \in \mathbb{R}^{m \times n}$ as a table, where each
element $a_{ij}$ belongs to the $i$^{th} row and $j$^{th} column:

\begin{equation}
  \mathbf{A}=
  \begin{bmatrix}
    a_{11} & a_{12} & \cdots & a_{1n} \\
    a_{21} & a_{22} & \cdots & a_{2n} \\
    \vdots & \vdots & \ddots & \vdots \\
    a_{m1} & a_{m2} & \cdots & a_{mn} \\
  \end{bmatrix}.
\end{equation}

For any $\mathbf{A} \in \mathbb{R}^{m \times n}$, the shape of
$\mathbf{A}$ is $(m, n)$ or $m \times n$. Specifically, when a matrix
has the same number of rows and columns, its shape becomes a square;
thus, it is called a *square matrix*.

We can create an $m \times n$ matrix by specifying a shape with two
components $m$ and $n$ when calling any of our favorite functions for
instantiating a NDArray.

#+begin_src clojure :results pp :exports both
(def A (-> (nd/arange ndm 20.)
           (nd/reshape 5 4)))
A
#+end_src

#+RESULTS:
: ND: (5, 4) cpu() float32
: [[ 0.,  1.,  2.,  3.],
:  [ 4.,  5.,  6.,  7.],
:  [ 8.,  9., 10., 11.],
:  [12., 13., 14., 15.],
:  [16., 17., 18., 19.],
: ]

We can access the scalar element $a_{ij}$ of a matrix $\mathbf{A}$ in
(2.3.2) by specifying the indices for the row ($i$) and column ($j$),
such as $[\mathbf{A}]_{ij}$. When the scalar elements of a matrix
$\mathbf{A}$, such as in (2.3.2), are not given, we may simply use the
lower-case letter of the matrix $\mathbf{A}$ with the index subscript,
$a_{ij}$, to refer to $[\mathbf{A}]_{ij}$. To keep notation simple,
commas are inserted to separate indices only when necessary, such as
$a_{2,3j}$ and $[\mathbf{A}]_{2i−1,3}$.

Sometimes, we want to flip the axes. When we exchange a matrix's rows
and columns, the result is called the transpose of the
matrix. Formally, we signify a matrix $\mathbf{A}$'s transpose by
$\mathbf{A}^\top$ and if $\mathbf{B}=\mathbf{A}^\top$, then
$b_{ij}=a_{ji}$ for any $i$ and $j$. Thus, the transpose of
$\mathbf{A}$ in (2.3.2) is a $n \times m$ matrix:

\begin{equation}
  \mathbf{A}^\top =
  \begin{bmatrix}
    a_{11} & a_{21} & \dots  & a_{m1} \\
    a_{12} & a_{22} & \dots  & a_{m2} \\
    \vdots & \vdots & \ddots  & \vdots \\
    a_{1n} & a_{2n} & \dots  & a_{mn}
  \end{bmatrix}.
\end{equation}

Now we access a matrix's transpose in code.

#+begin_src clojure :results pp :exports both :eval no-export
(nd/transpose A)
#+end_src

#+RESULTS:
: ND: (4, 5) cpu() float32
: [[ 0.,  4.,  8., 12., 16.],
:  [ 1.,  5.,  9., 13., 17.],
:  [ 2.,  6., 10., 14., 18.],
:  [ 3.,  7., 11., 15., 19.],
: ]

There is also a simplified function for the same purpose:

#+begin_src clojure :results pp :exports both :eval no-export
(nd/t A)
#+end_src

#+RESULTS:
: ND: (4, 5) cpu() float32
: [[ 0.,  4.,  8., 12., 16.],
:  [ 1.,  5.,  9., 13., 17.],
:  [ 2.,  6., 10., 14., 18.],
:  [ 3.,  7., 11., 15., 19.],
: ]

As a special type of the square matrix, a *symmetric matrix*
$\mathbf{A}$ is equal to its transpose:
$\mathbf{A}=\mathbf{A}^\top$. Here we define a symmetric matrix
$\mathbf{B}$.

#+begin_src clojure :results pp :exports both :eval no-export
(def B (nd/create ndm [[1 2 3] [2 0 4] [3 4 5]]))
B
#+end_src

#+RESULTS:
: ND: (3, 3) cpu() int64
: [[ 1,  2,  3],
:  [ 2,  0,  4],
:  [ 3,  4,  5],
: ]

Now we compare $\mathbf{B}$ with its transpose.

#+begin_src clojure :results pp :exports both :eval no-export
(nd/= B (nd/t B))
#+end_src

#+RESULTS:
: ND: (3, 3) cpu() boolean
: [[ true,  true,  true],
:  [ true,  true,  true],
:  [ true,  true,  true],
: ]

Matrices are useful data structures: they allow us to organize data
that have different modalities of variation. For example, rows in our
matrix might correspond to different houses (data examples), while
columns might correspond to different attributes. This should sound
familiar if you have ever used spreadsheet software or have read
Section 2.2. Thus, although the default orientation of a single vector
is a column vector, in a matrix that represents a tabular dataset, it
is more conventional to treat each data example as a row vector in the
matrix. And, as we will see in later chapters, this convention will
enable common deep learning practices. For example, along the
outermost axis of a NDArray, we can access or enumerate minibatches of
data examples, or just data examples if no minibatch exists.

