docs/2.3-linear-algebra.html

<div id="outline-container-org9c9b160" class="outline-3">
<h3 id="org9c9b160"><span class="section-number-3">1.3.</span> Length, Dimensionality, and Shape</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Let us revisit some concepts from <a href="2.1-data-manipulation.html">Section 2.1</a>. A vector is just an
array of numbers. And just as every array has a length, so does every
vector. In math notation, if we want to say that a vector \(\mathbf{x}\)
consists of \(n\) real-valued scalars, we can express this as
\(\mathbf{x} \in \mathbb{R}^n\). The length of a vector is commonly
called the <b>dimension</b> of the vector.
</p>

<p>
As with an ordinary Java array, we can access the length. In the case
of a NDArray we can achieve this by using the <code>(size ndarray 0)</code>
function, where \(0\) means the axis-0.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/size x<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
4
</pre>


<p>
When a NDArray represents a vector (with precisely one axis), we can
also access its length via the <code>shape</code> function. The shape lists the
length (dimensionality) along each axis of the NDArray. For NDArrays
with just one axis, the shape has just one element.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/shape x<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
(4)
</pre>


<p>
or we can use <code>get-shape</code> function:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/get-shape x<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
(4)
</pre>


<p>
Note that the word &ldquo;dimension&rdquo; tends to get overloaded in these
contexts and this tends to confuse people. To clarify, we use the
dimensionality of a <i>vector</i> or an <i>axis</i> to refer to its length, i.e.,
the number of elements of a vector or an axis. However, we use the
dimensionality of a NDArray to refer to the number of axes that a
NDArray has. In this sense, the dimensionality of some axis of a
NDArray will be the length of that axis.
</p>
</div>
</div>

<div id="outline-container-orgeed1b80" class="outline-3">
<h3 id="orgeed1b80"><span class="section-number-3">1.4.</span> Matrices</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Just as vectors generalize scalars from order zero to order one,
matrices generalize vectors from order one to order two. Matrices,
which we will typically denote with bold-faced, capital letters (e.g.,
\(\mathbf{X}\), \(\mathbf{Y}\), and \(\mathbf{Z}\)), are represented in code
as NDArray with two axes.
</p>

<p>
In math notation, we use \(\mathbf{A} \in \mathbb{R}^{m \times n}\) to
express that the matrix \(\mathbf{A}\) consists of \(m\) rows and \(n\)
columns of real-valued scalars. Visually, we can illustrate any matrix
\(\mathbf{A} \in \mathbb{R}^{m \times n}\) as a table, where each
element \(a_{ij}\) belongs to the \(i\)<sup>th</sup> row and \(j\)<sup>th</sup> column:
</p>

\begin{equation}
  \mathbf{A}=
  \begin{bmatrix}
    a_{11} & a_{12} & \cdots & a_{1n} \\
    a_{21} & a_{22} & \cdots & a_{2n} \\
    \vdots & \vdots & \ddots & \vdots \\
    a_{m1} & a_{m2} & \cdots & a_{mn} \\
  \end{bmatrix}.
\end{equation}

<p>
For any \(\mathbf{A} \in \mathbb{R}^{m \times n}\), the shape of
\(\mathbf{A}\) is \((m, n)\) or \(m \times n\). Specifically, when a matrix
has the same number of rows and columns, its shape becomes a square;
thus, it is called a <b>square matrix</b>.
</p>

<p>
We can create an \(m \times n\) matrix by specifying a shape with two
components \(m\) and \(n\) when calling any of our favorite functions for
instantiating a NDArray.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">def</span> <span style="color: #000000;">A</span> <span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">-&gt;</span> <span style="color: #909183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/arange ndm 20.<span style="color: #909183;">)</span>
           <span style="color: #909183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/reshape 5 4<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
A
</pre>
</div>

<pre class="example">
ND: (5, 4) cpu() float32
[[ 0.,  1.,  2.,  3.],
 [ 4.,  5.,  6.,  7.],
 [ 8.,  9., 10., 11.],
 [12., 13., 14., 15.],
 [16., 17., 18., 19.],
]
</pre>


<p>
We can access the scalar element \(a_{ij}\) of a matrix \(\mathbf{A}\) in
(2.3.2) by specifying the indices for the row (\(i\)) and column (\(j\)),
such as \([\mathbf{A}]_{ij}\). When the scalar elements of a matrix
\(\mathbf{A}\), such as in (2.3.2), are not given, we may simply use the
lower-case letter of the matrix \(\mathbf{A}\) with the index subscript,
\(a_{ij}\), to refer to \([\mathbf{A}]_{ij}\). To keep notation simple,
commas are inserted to separate indices only when necessary, such as
\(a_{2,3j}\) and \([\mathbf{A}]_{2i−1,3}\).
</p>

<p>
Sometimes, we want to flip the axes. When we exchange a matrix&rsquo;s rows
and columns, the result is called the transpose of the
matrix. Formally, we signify a matrix \(\mathbf{A}\)&rsquo;s transpose by
\(\mathbf{A}^\top\) and if \(\mathbf{B}=\mathbf{A}^\top\), then
\(b_{ij}=a_{ji}\) for any \(i\) and \(j\). Thus, the transpose of
\(\mathbf{A}\) in (2.3.2) is a \(n \times m\) matrix:
</p>

\begin{equation}
  \mathbf{A}^\top =
  \begin{bmatrix}
    a_{11} & a_{21} & \dots  & a_{m1} \\
    a_{12} & a_{22} & \dots  & a_{m2} \\
    \vdots & \vdots & \ddots  & \vdots \\
    a_{1n} & a_{2n} & \dots  & a_{mn}
  \end{bmatrix}.
\end{equation}

<p>
Now we access a matrix&rsquo;s transpose in code.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/transpose A<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
ND: (4, 5) cpu() float32
[[ 0.,  4.,  8., 12., 16.],
 [ 1.,  5.,  9., 13., 17.],
 [ 2.,  6., 10., 14., 18.],
 [ 3.,  7., 11., 15., 19.],
]
</pre>


<p>
There is also a simplified function for the same purpose:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/t A<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
ND: (4, 5) cpu() float32
[[ 0.,  4.,  8., 12., 16.],
 [ 1.,  5.,  9., 13., 17.],
 [ 2.,  6., 10., 14., 18.],
 [ 3.,  7., 11., 15., 19.],
]
</pre>


<p>
As a special type of the square matrix, a <b>symmetric matrix</b>
\(\mathbf{A}\) is equal to its transpose:
\(\mathbf{A}=\mathbf{A}^\top\). Here we define a symmetric matrix
\(\mathbf{B}\).
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">def</span> <span style="color: #000000;">B</span> <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/create ndm <span style="color: #909183;">[</span><span style="color: #709870;">[</span>1 2 3<span style="color: #709870;">]</span> <span style="color: #709870;">[</span>2 0 4<span style="color: #709870;">]</span> <span style="color: #709870;">[</span>3 4 5<span style="color: #709870;">]</span><span style="color: #909183;">]</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
B
</pre>
</div>

<pre class="example">
ND: (3, 3) cpu() int64
[[ 1,  2,  3],
 [ 2,  0,  4],
 [ 3,  4,  5],
]
</pre>


<p>
Now we compare \(\mathbf{B}\) with its transpose.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/= B <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/t B<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
ND: (3, 3) cpu() boolean
[[ true,  true,  true],
 [ true,  true,  true],
 [ true,  true,  true],
]
</pre>


<p>
Matrices are useful data structures: they allow us to organize data
that have different modalities of variation. For example, rows in our
matrix might correspond to different houses (data examples), while
columns might correspond to different attributes. This should sound
familiar if you have ever used spreadsheet software or have read
Section 2.2. Thus, although the default orientation of a single vector
is a column vector, in a matrix that represents a tabular dataset, it
is more conventional to treat each data example as a row vector in the
matrix. And, as we will see in later chapters, this convention will
enable common deep learning practices. For example, along the
outermost axis of a NDArray, we can access or enumerate minibatches of
data examples, or just data examples if no minibatch exists.
</p>
</div>
</div>
