notes/2.3-linear-algebra.org
** Tensors / NDArrays

Just as vectors generalize scalars, and matrices generalize vectors,
we can build data structures with even more axes. NDArrays ("NDArrays"
in this subsection refer to algebraic objects) give us a generic way
of describing $n$-dimensional arrays with an arbitrary number of
axes. Vectors, for example, are first-order NDArrays, and matrices are
second-order NDArrays. NDArrays are denoted with capital letters of a
special font face (e.g., $\mathbf{X}$, $\mathbf{Y}$, and $\mathbf{Z}$)
and their indexing mechanism (e.g., $x_{ijk}$ and $[X]_{1,2i−1,3}$) is
similar to that of matrices.

NDArrays will become more important when we start working with images,
which arrive as $n$-dimensional arrays with 3 axes corresponding to
the height, width, and a channel axis for stacking the color channels
(red, green, and blue). For now, we will skip over higher order
NDArrays and focus on the basics.

#+begin_src clojure :results pp :exports both :eval no-export
(def X (-> (nd/arange ndm 24.)
           (nd/reshape 2 3 4)))
X
#+end_src

#+RESULTS:
#+begin_example
ND: (2, 3, 4) cpu() float32
[[[ 0.,  1.,  2.,  3.],
  [ 4.,  5.,  6.,  7.],
  [ 8.,  9., 10., 11.],
 ],
 [[12., 13., 14., 15.],
  [16., 17., 18., 19.],
  [20., 21., 22., 23.],
 ],
]
#+end_example


** Basic Properties of Tensor Arithmetic

Scalars, vectors, matrices, and NDArrays ("NDArrays" in this
subsection refer to algebraic objects) of an arbitrary number of axes
have some nice properties that often come in handy. For example, you
might have noticed from the definition of an elementwise operation
that any elementwise unary operation does not change the shape of its
operand. Similarly, given any two NDArrays with the same shape, the
result of any binary elementwise operation will be a NDArray of that
same shape. For example, adding two matrices of the same shape
performs elementwise addition over these two matrices.

#+begin_src clojure :results silent :exports both :eval no-export
(def A (-> (nd/arange ndm 20.)
           (nd/reshape 5 4)))
(def B (nd/duplicate A))
#+end_src

#+begin_src clojure :results pp :exports both :eval no-export
A
#+end_src


#+RESULTS:
: ND: (5, 4) cpu() float32
: [[ 0.,  1.,  2.,  3.],
:  [ 4.,  5.,  6.,  7.],
:  [ 8.,  9., 10., 11.],
:  [12., 13., 14., 15.],
:  [16., 17., 18., 19.],
: ]

#+begin_src clojure :results pp :exports both :eval no-export
B
#+end_src

#+RESULTS:
: ND: (5, 4) cpu() float32
: [[ 0.,  1.,  2.,  3.],
:  [ 4.,  5.,  6.,  7.],
:  [ 8.,  9., 10., 11.],
:  [12., 13., 14., 15.],
:  [16., 17., 18., 19.],
: ]

#+begin_src clojure :results pp :exports both :eval no-export
(nd/+ A B)
#+end_src

#+RESULTS:
: ND: (5, 4) cpu() float32
: [[ 0.,  2.,  4.,  6.],
:  [ 8., 10., 12., 14.],
:  [16., 18., 20., 22.],
:  [24., 26., 28., 30.],
:  [32., 34., 36., 38.],
: ]

Specifically, elementwise multiplication of two matrices is called
their Hadamard product (math notation $\odot$). Consider matrix
$\mathbf{B} \in \mathbb{R}^{m \times n}$ whose element of row $i$ and
column $j$ is $b_{ij}$. The Hadamard product of matrices $\mathbf{A}$
(defined in (2.3.2)) and $\mathbf{B}$

\begin{equation}
   \mathbf{A} \odot \mathbf{B} =
   \begin{bmatrix}
       a_{11}  b_{11} & a_{12}  b_{12} & \dots  & a_{1n}  b_{1n} \\
       a_{21}  b_{21} & a_{22}  b_{22} & \dots  & a_{2n}  b_{2n} \\
       \vdots & \vdots & \ddots & \vdots \\
       a_{m1}  b_{m1} & a_{m2}  b_{m2} & \dots  & a_{mn}  b_{mn}
   \end{bmatrix}.
\end{equation}

#+begin_src clojure :results pp :exports both :eval no-export
(nd/* A B)
#+end_src

#+RESULTS:
: ND: (5, 4) cpu() float32
: [[  0.,   1.,   4.,   9.],
:  [ 16.,  25.,  36.,  49.],
:  [ 64.,  81., 100., 121.],
:  [144., 169., 196., 225.],
:  [256., 289., 324., 361.],
: ]

Multiplying or adding a NDArray by a scalar also does not change the
shape of the NDArray, where each element of the operand NDArray will
be added or multiplied by the scalar.

#+begin_src clojure :results pp :exports both :eval no-export
(def a 2)
(def X (-> (nd/arange ndm 24.)
           (nd/reshape 2 3 4)))
(nd/+ X a)
#+end_src

#+RESULTS:
#+begin_example
ND: (2, 3, 4) cpu() float32
[[[ 2.,  3.,  4.,  5.],
  [ 6.,  7.,  8.,  9.],
  [10., 11., 12., 13.],
 ],
 [[14., 15., 16., 17.],
  [18., 19., 20., 21.],
  [22., 23., 24., 25.],
 ],
]
#+end_example

#+begin_src clojure :results pp :exports both :eval no-export
(nd/shape (nd/* X a))
#+end_src

#+RESULTS:
: (2, 3, 4)


