docs/2.3-linear-algebra.html

<div id="outline-container-org988f23b" class="outline-3">
<h3 id="org988f23b"><span class="section-number-3">1.5.</span> Tensors / NDArrays</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Just as vectors generalize scalars, and matrices generalize vectors,
we can build data structures with even more axes. NDArrays (&ldquo;NDArrays&rdquo;
in this subsection refer to algebraic objects) give us a generic way
of describing $n$-dimensional arrays with an arbitrary number of
axes. Vectors, for example, are first-order NDArrays, and matrices are
second-order NDArrays. NDArrays are denoted with capital letters of a
special font face (e.g., \(\mathbf{X}\), \(\mathbf{Y}\), and \(\mathbf{Z}\))
and their indexing mechanism (e.g., \(x_{ijk}\) and \([X]_{1,2i−1,3}\)) is
similar to that of matrices.
</p>

<p>
NDArrays will become more important when we start working with images,
which arrive as $n$-dimensional arrays with 3 axes corresponding to
the height, width, and a channel axis for stacking the color channels
(red, green, and blue). For now, we will skip over higher order
NDArrays and focus on the basics.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">def</span> <span style="color: #000000;">X</span> <span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">-&gt;</span> <span style="color: #909183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/arange ndm 24.<span style="color: #909183;">)</span>
           <span style="color: #909183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/reshape 2 3 4<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
X
</pre>
</div>

<pre class="example" id="orgb3db7b8">
ND: (2, 3, 4) cpu() float32
[[[ 0.,  1.,  2.,  3.],
  [ 4.,  5.,  6.,  7.],
  [ 8.,  9., 10., 11.],
 ],
 [[12., 13., 14., 15.],
  [16., 17., 18., 19.],
  [20., 21., 22., 23.],
 ],
]
</pre>
</div>
</div>


<div id="outline-container-org2aebf18" class="outline-3">
<h3 id="org2aebf18"><span class="section-number-3">1.6.</span> Basic Properties of Tensor Arithmetic</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Scalars, vectors, matrices, and NDArrays (&ldquo;NDArrays&rdquo; in this
subsection refer to algebraic objects) of an arbitrary number of axes
have some nice properties that often come in handy. For example, you
might have noticed from the definition of an elementwise operation
that any elementwise unary operation does not change the shape of its
operand. Similarly, given any two NDArrays with the same shape, the
result of any binary elementwise operation will be a NDArray of that
same shape. For example, adding two matrices of the same shape
performs elementwise addition over these two matrices.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">def</span> <span style="color: #000000;">A</span> <span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">-&gt;</span> <span style="color: #909183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/arange ndm 20.<span style="color: #909183;">)</span>
           <span style="color: #909183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/reshape 5 4<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">def</span> <span style="color: #000000;">B</span> <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/duplicate A<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-clojure">A
</pre>
</div>


<pre class="example">
ND: (5, 4) cpu() float32
[[ 0.,  1.,  2.,  3.],
 [ 4.,  5.,  6.,  7.],
 [ 8.,  9., 10., 11.],
 [12., 13., 14., 15.],
 [16., 17., 18., 19.],
]
</pre>


<div class="org-src-container">
<pre class="src src-clojure">B
</pre>
</div>

<pre class="example">
ND: (5, 4) cpu() float32
[[ 0.,  1.,  2.,  3.],
 [ 4.,  5.,  6.,  7.],
 [ 8.,  9., 10., 11.],
 [12., 13., 14., 15.],
 [16., 17., 18., 19.],
]
</pre>


<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/+ A B<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
ND: (5, 4) cpu() float32
[[ 0.,  2.,  4.,  6.],
 [ 8., 10., 12., 14.],
 [16., 18., 20., 22.],
 [24., 26., 28., 30.],
 [32., 34., 36., 38.],
]
</pre>


<p>
Specifically, elementwise multiplication of two matrices is called
their <i>Hadamard product</i> (math notation \(\odot\)). Consider matrix
\(\mathbf{B} \in \mathbb{R}^{m \times n}\) whose element of row \(i\) and
column \(j\) is \(b_{ij}\). The Hadamard product of matrices \(\mathbf{A}\)
(defined in (2.3.2)) and \(\mathbf{B}\)
</p>

\begin{equation}
   \mathbf{A} \odot \mathbf{B} =
   \begin{bmatrix}
       a_{11}  b_{11} & a_{12}  b_{12} & \dots  & a_{1n}  b_{1n} \\
       a_{21}  b_{21} & a_{22}  b_{22} & \dots  & a_{2n}  b_{2n} \\
       \vdots & \vdots & \ddots & \vdots \\
       a_{m1}  b_{m1} & a_{m2}  b_{m2} & \dots  & a_{mn}  b_{mn}
   \end{bmatrix}.
\end{equation}

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/* A B<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
ND: (5, 4) cpu() float32
[[  0.,   1.,   4.,   9.],
 [ 16.,  25.,  36.,  49.],
 [ 64.,  81., 100., 121.],
 [144., 169., 196., 225.],
 [256., 289., 324., 361.],
]
</pre>


<p>
Multiplying or adding a NDArray by a scalar also does not change the
shape of the NDArray, where each element of the operand NDArray will
be added or multiplied by the scalar.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">def</span> <span style="color: #000000;">a</span> 2<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">def</span> <span style="color: #000000;">X</span> <span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">-&gt;</span> <span style="color: #909183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/arange ndm 24.<span style="color: #909183;">)</span>
           <span style="color: #909183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/reshape 2 3 4<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/+ X a<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example" id="org3f61308">
ND: (2, 3, 4) cpu() float32
[[[ 2.,  3.,  4.,  5.],
  [ 6.,  7.,  8.,  9.],
  [10., 11., 12., 13.],
 ],
 [[14., 15., 16., 17.],
  [18., 19., 20., 21.],
  [22., 23., 24., 25.],
 ],
]
</pre>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/shape <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/* X a<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
(2, 3, 4)
</pre>
</div>
</div>
