notes/2.3-linear-algebra.org
** Reduction

One useful operation that we can perform with arbitrary NDArrays is to
calculate the sum of their elements. In mathematical notation, we
express sums using the $\sum$ symbol. To express the sum of the
elements in a vector $x$ of length $d$, we write $\sum^d_{i=1}
x_i$. In code, we can just call the function for calculating the sum.

#+begin_src clojure :results pp :exports both :eval no-export
(def x (nd/arange ndm 4.))
x
#+end_src

#+RESULTS:
: ND: (4) cpu() float32
: [0., 1., 2., 3.]

#+begin_src clojure :results pp :exports both :eval no-export
(nd/sum x)
#+end_src

#+RESULTS:
: ND: () cpu() float32
: 6.

We can express sums over the elements of NDArrays of arbitrary
shape. For example, the sum of the elements of an $m \times n$ matrix
$\mathbf{A}$ could be written $\sum^m_{i=1} \sum^n_{j=1} a_{ij}$.

#+begin_src clojure :results pp :exports both :eval no-export
(nd/shape A)
#+end_src

#+RESULTS:
: (5, 4)

#+begin_src clojure :results pp :exports both :eval no-export
(nd/sum A)
#+end_src

#+RESULTS:
: ND: () cpu() float32
: 190.

By default, invoking the function for calculating the sum reduces a
NDArray along all its axes to a scalar. We can also specify the axes
along which the NDArray is reduced via summation. Take matrices as an
example. To reduce the row dimension (axis 0) by summing up elements
of all the rows, we specify ~[0]~ when invoking the function. Since the
input matrix reduces along axis 0 to generate the output vector, the
dimension of axis 0 of the input is lost in the output shape.

#+begin_src clojure :results pp :exports both :eval no-export
(def A-sum-axis0 (nd/sum A [0]))
A-sum-axis0
#+end_src

#+RESULTS:
: ND: (4) cpu() float32
: [40., 45., 50., 55.]

#+begin_src clojure :results pp :exports both :eval no-export
(nd/shape A-sum-axis0)
#+end_src

#+RESULTS:
: (4)

Specifying ~[1]~ will reduce the column dimension (axis 1) by summing up
elements of all the columns. Thus, the dimension of axis 1 of the
input is lost in the output shape.

#+begin_src clojure :results pp :exports both :eval no-export
(def A-sum-axis1 (nd/sum A [1]))
A-sum-axis1
#+end_src

#+RESULTS:
: ND: (5) cpu() float32
: [ 6., 22., 38., 54., 70.]

#+begin_src clojure :results pp :exports both :eval no-export
(nd/shape A-sum-axis1)
#+end_src

#+RESULTS:
: (5)

Reducing a matrix along both rows and columns via summation is
equivalent to summing up all the elements of the matrix.

#+begin_src clojure :results pp :exports both :eval no-export
(nd/sum A [0 1])
#+end_src

#+RESULTS:
: ND: () cpu() float32
: 190.

A related quantity is the *mean*, which is also called the average. We
calculate the mean by dividing the sum by the total number of
elements. In code, we could just call the function for calculating the
mean on NDArrays of arbitrary shape.

#+begin_src clojure :results pp :exports both :eval no-export
(nd/mean A)
#+end_src

#+RESULTS:
: ND: () cpu() float32
: 9.5

#+begin_src clojure :results pp :exports both :eval no-export
(nd// (nd/sum A) (nd/size A))
#+end_src

#+RESULTS:
: ND: () cpu() float32
: 9.5

Likewise, the function for calculating the mean can also reduce a
NDArray along the specified axes.

#+begin_src clojure :results pp :exports both :eval no-export
(nd/mean A [0])
#+end_src

#+RESULTS:
: ND: (4) cpu() float32
: [ 8.,  9., 10., 11.]

#+begin_src clojure :results pp :exports both :eval no-export
(nd/shape A)
#+end_src

#+RESULTS:
: (5, 4)


#+begin_src clojure :results pp :exports both :eval no-export
(nd// (nd/sum A [0]) (nd/get (nd/shape A) 0))
#+end_src

#+RESULTS:
: ND: (4) cpu() float32
: [ 8.,  9., 10., 11.]


