docs/2.3-linear-algebra.html


<div id="outline-container-lin-alg-non-reduction" class="outline-4">
<h4 id="lin-alg-non-reduction"><span class="section-number-4">1.7.1.</span> Non-Reduction Sum</h4>
<div class="outline-text-4" id="text-lin-alg-non-reduction">
<p>
However, sometimes it can be useful to keep the number of axes
unchanged when invoking the function for calculating the sum or mean.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">def</span> <span style="color: #000000;">sum-A</span> <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/sum A <span style="color: #909183;">[</span>1<span style="color: #909183;">]</span> <span style="color: #110099;">true</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
sum-A
</pre>
</div>

<pre class="example">
ND: (5, 1) cpu() float32
[[ 6.],
 [22.],
 [38.],
 [54.],
 [70.],
]
</pre>


<p>
For instance, since <code>sum-A</code> still keeps its two axes after summing each
row, we can divide <code>A</code> by <code>sum-A</code> with broadcasting.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>// A sum-A<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
ND: (5, 4) cpu() float32
[[0.    , 0.1667, 0.3333, 0.5   ],
 [0.1818, 0.2273, 0.2727, 0.3182],
 [0.2105, 0.2368, 0.2632, 0.2895],
 [0.2222, 0.2407, 0.2593, 0.2778],
 [0.2286, 0.2429, 0.2571, 0.2714],
]
</pre>


<p>
If we want to calculate the cumulative sum of elements of A along some
axis, say axis 0 (row by row), we can call the <code>cumsum</code> function. This
function will not reduce the input NDArray along any axis.
</p>

<div class="org-src-container">
<pre class="src src-clojure">A
</pre>
</div>

<pre class="example">
ND: (5, 4) cpu() float32
[[ 0.,  1.,  2.,  3.],
 [ 4.,  5.,  6.,  7.],
 [ 8.,  9., 10., 11.],
 [12., 13., 14., 15.],
 [16., 17., 18., 19.],
]
</pre>



<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/cumsum A 0<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
ND: (5, 4) cpu() float32
[[ 0.,  1.,  2.,  3.],
 [ 4.,  6.,  8., 10.],
 [12., 15., 18., 21.],
 [24., 28., 32., 36.],
 [40., 45., 50., 55.],
]
</pre>


<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/cumsum A 1<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
ND: (5, 4) cpu() float32
[[ 0.,  1.,  3.,  6.],
 [ 4.,  9., 15., 22.],
 [ 8., 17., 27., 38.],
 [12., 25., 39., 54.],
 [16., 33., 51., 70.],
]
</pre>
</div>
</div>
</div>


<div id="outline-container-org8b72aeb" class="outline-3">
<h3 id="org8b72aeb"><span class="section-number-3">1.8.</span> Dot Products</h3>
<div class="outline-text-3" id="text-1-8">
<p>
So far, we have only performed elementwise operations, sums, and
averages. And if this was all we could do, linear algebra probably
would not deserve its own section. However, one of the most
fundamental operations is the dot product. Given two vectors \(x,y \in
\mathbb{R}^d\), their dot product \(x^\top y\) (or \(\langle x,y \rangle\))
is a sum over the products of the elements at the same position:
\(x^\top y = \sum^d_{i=1} x_i y_i\).
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">def</span> <span style="color: #000000;">y</span> <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/ones ndm <span style="color: #909183;">[</span>4<span style="color: #909183;">]</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
#'clj-d2l.linear-algebra/y
</pre>


<div class="org-src-container">
<pre class="src src-clojure">x
</pre>
</div>

<pre class="example">
ND: (4) cpu() float32
[0., 1., 2., 3.]
</pre>


<div class="org-src-container">
<pre class="src src-clojure">y
</pre>
</div>

<pre class="example">
ND: (4) cpu() float32
[1., 1., 1., 1.]
</pre>


<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/dot x y<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
ND: () cpu() float32
6.
</pre>


<p>
Note that we can express the dot product of two vectors equivalently
by performing an elementwise multiplication and then a sum:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/sum <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/* x y<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
ND: () cpu() float32
6.
</pre>


<p>
Dot products are useful in a wide range of contexts. For example,
given some set of values, denoted by a vector \(x \in \mathbb{R}^d\) and
a set of weights denoted by \(w \in \mathbb{R}^d\), the weighted sum of
the values in \(x\) according to the weights \(w\) could be expressed as
the dot product \(x^\top w\). When the weights are non-negative and sum
to one (i.e., (\(\sum^d_{i=1} w_i = 1\))), the dot product expresses a
weighted average. After normalizing two vectors to have the unit
length, the dot products express the cosine of the angle between
them. We will formally introduce this notion of length later in this
section.
</p>
</div>
</div>

<div id="outline-container-org069ddea" class="outline-3">
<h3 id="org069ddea"><span class="section-number-3">1.9.</span> Matrix-Vector Products</h3>
<div class="outline-text-3" id="text-1-9">
<p>
Now that we know how to calculate dot products, we can begin to
understand matrix-vector products. Recall the matrix \(\mathbf{A} \in
\mathbb{R}^{m \times n}\) and the vector \(x \in \mathbb{R}^n\) defined
and visualized in (2.3.2) and (2.3.1) respectively. Let us start off
by visualizing the matrix \(\mathbf{A}\) in terms of its row vectors
</p>

\begin{equation}
  \mathbf{A}=
  \begin{bmatrix}
    \mathbf{a}^\top_{1} \\
    \mathbf{a}^\top_{2} \\
    \vdots \\
    \mathbf{a}^\top_m \\
  \end{bmatrix},
\end{equation}

<p>
where each \(\mathbf{a}^\top_i \in \mathbb{R}^n\) is a row vector
representing the \(i\)<sup>th</sup> row of the matrix \(\mathbf{A}\). The
matrix-vector product \(\mathbf{A}\mathbf{x}\) is simply a column vector
of length \(m\), whose \(i\)<sup>th</sup> element is the dot product
\(\mathbf{a}^top_i \mathbf{x}\):
</p>

\begin{equation}
  \mathbf{A}\mathbf{x}
  = \begin{bmatrix}
    \mathbf{a}^\top_{1} \\
    \mathbf{a}^\top_{2} \\
    \vdots \\
    \mathbf{a}^\top_m \\
  \end{bmatrix}\mathbf{x}
  = \begin{bmatrix}
    \mathbf{a}^\top_{1} \mathbf{x}  \\
    \mathbf{a}^\top_{2} \mathbf{x} \\
    \vdots\\
    \mathbf{a}^\top_{m} \mathbf{x}\\
  \end{bmatrix}.
\end{equation}

<p>
We can think of multiplication by a matrix \(\mathbf{A} \in
\mathbb{R}^{m \times n}\) as a transformation that projects vectors
from \(\mathbb{R}^n\) to \(\mathbb{R}^m\). These transformations turn out
to be remarkably useful. For example, we can represent rotations as
multiplications by a square matrix. As we will see in subsequent
chapters, we can also use matrix-vector products to describe the most
intensive calculations required when computing each layer in a neural
network given the values of the previous layer.
</p>

<p>
Expressing matrix-vector products in code with NDArrays, we use the
same dot function as for dot products. When we call <code>(nd/dot A x)</code> with
a matrix \(\mathbf{A}\) and a vector \(\mathbf{x}\), the matrix-vector
product is performed. Note that the column dimension of \(\mathbf{A}\)
(its length along axis 1) must be the same as the dimension of
\(\mathbf{x}\) (its length).
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/shape A<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
(5, 4)
</pre>


<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/shape x<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
(4)
</pre>


<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/dot A x<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
ND: (5) cpu() float32
[ 14.,  38.,  62.,  86., 110.]
</pre>
</div>
</div>
