notes/2.3-linear-algebra.org
** Matrix-Matrix Multiplication

If you have gotten the hang of dot products and matrix-vector
products, then matrix-matrix multiplication should be straightforward.

Say that we have two matrices $\mathbf{A} \in \mathbb{R}^{n \times k}$
and $\mathbf{B} \in \mathbb{R}^{k \times m}$:

\begin{equation}
   \mathbf{A}=\begin{bmatrix}
    a_{11} & a_{12} & \cdots & a_{1k} \\
    a_{21} & a_{22} & \cdots & a_{2k} \\
   \vdots & \vdots & \ddots & \vdots \\
    a_{n1} & a_{n2} & \cdots & a_{nk} \\
   \end{bmatrix},\quad
   \mathbf{B}=\begin{bmatrix}
    b_{11} & b_{12} & \cdots & b_{1m} \\
    b_{21} & b_{22} & \cdots & b_{2m} \\
   \vdots & \vdots & \ddots & \vdots \\
    b_{k1} & b_{k2} & \cdots & b_{km} \\
   \end{bmatrix}.
\end{equation}

Denote by $\mathbf{a}^\top_i \in \mathbb{R}^k$ the row vector
representing the $i$^{th} row of the matrix $\mathbf{A}$, and let
$\mathbf{b}_j \in \mathbb{R}^k$ be the column vector from the $j$^{th}
column of the matrix $\mathbf{B}$. To produce the matrix product
$\mathbf{C}=\mathbf{AB}$, it is easiest to think of $\mathbf{A}$ in
terms of its row vectors and $\mathbf{B}$ in terms of its column
vectors:

\begin{equation}
   \mathbf{A}=
   \begin{bmatrix}
   \mathbf{a}^\top_{1} \\
   \mathbf{a}^\top_{2} \\
   \vdots \\
   \mathbf{a}^\top_n \\
   \end{bmatrix},
   \quad \mathbf{B}=\begin{bmatrix}
    \mathbf{b}_{1} & \mathbf{b}_{2} & \cdots & \mathbf{b}_{m} \\
   \end{bmatrix}.
\end{equation}

Then the matrix product $\mathbf{C} \in \mathbb{R}^{n \times m}$ is
produced as we simply compute each element $c_{ij}$ as the dot product
$\mathbf{a}^\top_i \mathbf{b}_j$:

\begin{equation}
   \mathbf{C} = \mathbf{AB} = \begin{bmatrix}
   \mathbf{a}^\top_{1} \\
   \mathbf{a}^\top_{2} \\
   \vdots \\
   \mathbf{a}^\top_n \\
   \end{bmatrix}
   \begin{bmatrix}
    \mathbf{b}_{1} & \mathbf{b}_{2} & \cdots & \mathbf{b}_{m} \\
   \end{bmatrix}
   = \begin{bmatrix}
   \mathbf{a}^\top_{1} \mathbf{b}_1 & \mathbf{a}^\top_{1}\mathbf{b}_2& \cdots & \mathbf{a}^\top_{1} \mathbf{b}_m \\
    \mathbf{a}^\top_{2}\mathbf{b}_1 & \mathbf{a}^\top_{2} \mathbf{b}_2 & \cdots & \mathbf{a}^\top_{2} \mathbf{b}_m \\
    \vdots & \vdots & \ddots &\vdots\\
   \mathbf{a}^\top_{n} \mathbf{b}_1 & \mathbf{a}^\top_{n}\mathbf{b}_2& \cdots& \mathbf{a}^\top_{n} \mathbf{b}_m
   \end{bmatrix}.
\end{equation}

We can think of the matrix-matrix multiplication $\mathbf{AB}$ as
simply performing $m$ matrix-vector products and stitching the results
together to form an $n \times m$ matrix. In the following snippet, we
perform matrix multiplication on $\mathbf{A}$ and $\mathbf{B}$. Here,
$\mathbf{A}$ is a matrix with 5 rows and 4 columns, and $\mathbf{B}$
is a matrix with 4 rows and 3 columns. After multiplication, we obtain
a matrix with 5 rows and 3 columns.

#+begin_src clojure :results pp :exports both :eval no-export
(def B (nd/ones ndm [4 3]))
B
#+end_src

#+RESULTS:
: ND: (4, 3) cpu() float32
: [[1., 1., 1.],
:  [1., 1., 1.],
:  [1., 1., 1.],
:  [1., 1., 1.],
: ]

#+begin_src clojure :results pp :exports both :eval no-export
A
#+end_src

#+RESULTS:
: ND: (5, 4) cpu() float32
: [[ 0.,  1.,  2.,  3.],
:  [ 4.,  5.,  6.,  7.],
:  [ 8.,  9., 10., 11.],
:  [12., 13., 14., 15.],
:  [16., 17., 18., 19.],
: ]

#+begin_src clojure :results pp :exports both :eval no-export
(nd/dot A B)
#+end_src

#+RESULTS:
: ND: (5, 3) cpu() float32
: [[ 6.,  6.,  6.],
:  [22., 22., 22.],
:  [38., 38., 38.],
:  [54., 54., 54.],
:  [70., 70., 70.],
: ]

Matrix-matrix multiplication can be simply called matrix
multiplication, and should not be confused with the Hadamard product.


