docs/2.3-linear-algebra.html


<div id="outline-container-org179830c" class="outline-3">
<h3 id="org179830c"><span class="section-number-3">1.10.</span> Matrix-Matrix Multiplication</h3>
<div class="outline-text-3" id="text-1-10">
<p>
If you have gotten the hang of dot products and matrix-vector
products, then matrix-matrix multiplication should be straightforward.
</p>

<p>
Say that we have two matrices \(\mathbf{A} \in \mathbb{R}^{n \times k}\)
and \(\mathbf{B} \in \mathbb{R}^{k \times m}\):
</p>

\begin{equation}
   \mathbf{A}=\begin{bmatrix}
    a_{11} & a_{12} & \cdots & a_{1k} \\
    a_{21} & a_{22} & \cdots & a_{2k} \\
   \vdots & \vdots & \ddots & \vdots \\
    a_{n1} & a_{n2} & \cdots & a_{nk} \\
   \end{bmatrix},\quad
   \mathbf{B}=\begin{bmatrix}
    b_{11} & b_{12} & \cdots & b_{1m} \\
    b_{21} & b_{22} & \cdots & b_{2m} \\
   \vdots & \vdots & \ddots & \vdots \\
    b_{k1} & b_{k2} & \cdots & b_{km} \\
   \end{bmatrix}.
\end{equation}

<p>
Denote by \(\mathbf{a}^\top_i \in \mathbb{R}^k\) the row vector
representing the \(i\)<sup>th</sup> row of the matrix \(\mathbf{A}\), and let
\(\mathbf{b}_j \in \mathbb{R}^k\) be the column vector from the \(j\)<sup>th</sup>
column of the matrix \(\mathbf{B}\). To produce the matrix product
\(\mathbf{C}=\mathbf{AB}\), it is easiest to think of \(\mathbf{A}\) in
terms of its row vectors and \(\mathbf{B}\) in terms of its column
vectors:
</p>

\begin{equation}
   \mathbf{A}=
   \begin{bmatrix}
   \mathbf{a}^\top_{1} \\
   \mathbf{a}^\top_{2} \\
   \vdots \\
   \mathbf{a}^\top_n \\
   \end{bmatrix},
   \quad \mathbf{B}=\begin{bmatrix}
    \mathbf{b}_{1} & \mathbf{b}_{2} & \cdots & \mathbf{b}_{m} \\
   \end{bmatrix}.
\end{equation}

<p>
Then the matrix product \(\mathbf{C} \in \mathbb{R}^{n \times m}\) is
produced as we simply compute each element \(c_{ij}\) as the dot product
\(\mathbf{a}^\top_i \mathbf{b}_j\):
</p>

\begin{equation}
   \mathbf{C} = \mathbf{AB} = \begin{bmatrix}
   \mathbf{a}^\top_{1} \\
   \mathbf{a}^\top_{2} \\
   \vdots \\
   \mathbf{a}^\top_n \\
   \end{bmatrix}
   \begin{bmatrix}
    \mathbf{b}_{1} & \mathbf{b}_{2} & \cdots & \mathbf{b}_{m} \\
   \end{bmatrix}
   = \begin{bmatrix}
   \mathbf{a}^\top_{1} \mathbf{b}_1 & \mathbf{a}^\top_{1}\mathbf{b}_2& \cdots & \mathbf{a}^\top_{1} \mathbf{b}_m \\
    \mathbf{a}^\top_{2}\mathbf{b}_1 & \mathbf{a}^\top_{2} \mathbf{b}_2 & \cdots & \mathbf{a}^\top_{2} \mathbf{b}_m \\
    \vdots & \vdots & \ddots &\vdots\\
   \mathbf{a}^\top_{n} \mathbf{b}_1 & \mathbf{a}^\top_{n}\mathbf{b}_2& \cdots& \mathbf{a}^\top_{n} \mathbf{b}_m
   \end{bmatrix}.
\end{equation}

<p>
We can think of the matrix-matrix multiplication \(\mathbf{AB}\) as
simply performing \(m\) matrix-vector products and stitching the results
together to form an \(n \times m\) matrix. In the following snippet, we
perform matrix multiplication on \(\mathbf{A}\) and \(\mathbf{B}\). Here,
\(\mathbf{A}\) is a matrix with 5 rows and 4 columns, and \(\mathbf{B}\)
is a matrix with 4 rows and 3 columns. After multiplication, we obtain
a matrix with 5 rows and 3 columns.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">def</span> <span style="color: #000000;">B</span> <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/ones ndm <span style="color: #909183;">[</span>4 3<span style="color: #909183;">]</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
B
</pre>
</div>

<pre class="example">
ND: (4, 3) cpu() float32
[[1., 1., 1.],
 [1., 1., 1.],
 [1., 1., 1.],
 [1., 1., 1.],
]
</pre>


<div class="org-src-container">
<pre class="src src-clojure">A
</pre>
</div>

<pre class="example">
ND: (5, 4) cpu() float32
[[ 0.,  1.,  2.,  3.],
 [ 4.,  5.,  6.,  7.],
 [ 8.,  9., 10., 11.],
 [12., 13., 14., 15.],
 [16., 17., 18., 19.],
]
</pre>


<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">nd</span>/dot A B<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
ND: (5, 3) cpu() float32
[[ 6.,  6.,  6.],
 [22., 22., 22.],
 [38., 38., 38.],
 [54., 54., 54.],
 [70., 70., 70.],
]
</pre>


<p>
Matrix-matrix multiplication can be simply called matrix
multiplication, and should not be confused with the Hadamard product.
</p>
</div>
</div>
