notes/2.3-linear-algebra.org
** Norms

Some of the most useful operators in linear algebra are
norms. Informally, the *norm of a vector* tells us how big a vector
is. The notion of size under consideration here concerns not
dimensionality but rather the magnitude of the components.

In linear algebra, a vector norm is a function $f$ that maps a vector
to a scalar, satisfying a handful of properties. Given any vector
$\mathbf{x}$, the first property says that if we scale all the
elements of a vector by a constant factor $\alpha$, its norm also
scales by the absolute value of the same constant factor:

\begin{equation}
f(\alhpa \mathbf{x} = |\alpha| f(\mathbf{x}).
\end{equation}

The second property is the familiar triangle inequality:

\begin{equation}
f(\mathbf{x} + \mathbf{y}) \leq f(\mathbf{x}) + f(\mathbf{y}).
\end{equation}

The third property simply says that the norm must be non-negative:

\begin{equation}
f(\mathbf{x}) \geq 0.
\end{equation}

That makes sense, as in most contexts the smallest size for anything
is 0. The final property requires that the smallest norm is achieved
and only achieved by a vector consisting of all zeros.

\begin{equation}
\forall i, [\mathbf{x}]_i = 0 \Leftrightarrow f(\mathbf{x})=0.
\end{equation}

You might notice that norms sound a lot like measures of distance. And
if you remember Euclidean distances (think Pythagoras' theorem) from
grade school, then the concepts of non-negativity and the triangle
inequality might ring a bell. In fact, the Euclidean distance is a
norm: specifically it is the $L_2$ norm. Suppose that the elements in
the $n$-dimensional vector $\mathbf{x}$ are $x_1, \ldots, x_n$. The
$L_2$ norm of $\mathbf{x}$ is the square root of the sum of the
squares of the vector elements:

\begin{equation}
\|\mathbf{x}\|_2 = \sqrt{\sum_{i=1}^n x_i^2},
\end{equation}

where the subscript $2$ is often omitted in $L_2$ norms, i.e.,
$\|\mathbf{x}\|$ is equivalent to $\|\mathbf{x}\|_2$. In code, we can
calculate the $L_2$ norm of a vector as follows.

#+begin_src clojure :results silent :eval no-export
(defn l2norm [ndarray]
  (-> ndarray
      (nd/pow 2)
      (nd/sum)
      (nd/sqrt)))
#+end_src

#+begin_src clojure :results pp :exports both :eval no-export
(def u (nd/create ndm [3. -4.]))
u
#+end_src

#+RESULTS:
: ND: (2) cpu() float64
: [ 3., -4.]

#+begin_src clojure :results pp :exports both :eval no-export
(l2norm u)
#+end_src

#+RESULTS:
: ND: () cpu() float64
: 5.

In deep learning, we work more often with the squared $L_2$ norm. You
will also frequently encounter the $L_1$ norm, which is expressed as
the sum of the absolute values of the vector elements:

\begin{equation}
\|\mathbf{x}\|_1 = \sum_{i=1}^n \left|x_i \right|.
\end{equation}

As compared with the $L_2$ norm, it is less influenced by outliers. To
calculate the $L_1$ norm, we compose the absolute value function with
a sum over the elements.

#+begin_src clojure :results pp :exports both :eval no-export
(nd/sum (nd/abs u))
#+end_src

#+RESULTS:
: ND: () cpu() float64
: 7.

Both the $L_2$ norm and the $L_1$ norm are special cases of the more
general $L_p$ norm:

\begin{equation}
\|\mathbf{x}\|_p = \left(\sum_{i=1}^n \left|x_i \right|^p \right)^{1/p}.
\end{equation}

Analogous to $L_2$ norms of vectors, the Frobenius norm of a matrix
$\mathbf{X} \in \mathbb{R}^{m \times n}$ is the square root of the sum
of the squares of the matrix elements:

\begin{equation}
\|\mathbf{X}\|_F = \sqrt{\sum_{i=1}^m \sum_{j=1}^n x_{ij}^2}.
\end{equation}

The Frobenius norm satisfies all the properties of vector norms. It
behaves as if it were an $L_2$ norm of a matrix-shaped
vector. Invoking the following function will calculate the Frobenius
norm of a matrix.

#+begin_src clojure :results pp :exports both :eval no-export
(l2norm (nd/ones ndm [4 9]))
#+end_src

#+RESULTS:
: ND: () cpu() float32
: 6.

** Norms and Objectives

While we do not want to get too far ahead of ourselves, we can plant
some intuition already about why these concepts are useful. In deep
learning, we are often trying to solve optimization problems: *maximize*
the probability assigned to observed data; *minimize* the distance
between predictions and the ground-truth observations. Assign vector
representations to items (like words, products, or news articles) such
that the distance between similar items is minimized, and the distance
between dissimilar items is maximized. Oftentimes, the objectives,
perhaps the most important components of deep learning algorithms
(besides the data), are expressed as norms.

** More on Linear Algebra

In just this section, we have taught you all the linear algebra that
you will need to understand a remarkable chunk of modern deep
learning. There is a lot more to linear algebra and a lot of that
mathematics is useful for machine learning. For example, matrices can
be decomposed into factors, and these decompositions can reveal
low-dimensional structure in real-world datasets. There are entire
subfields of machine learning that focus on using matrix
decompositions and their generalizations to high-order NDArrays to
discover structure in datasets and solve prediction problems. But this
book focuses on deep learning. And we believe you will be much more
inclined to learn more mathematics once you have gotten your hands
dirty deploying useful machine learning models on real datasets. So
while we reserve the right to introduce more mathematics much later
on, we will wrap up this section here.

If you are eager to learn more about linear algebra, you may refer to
either the online appendix on linear algebraic operations or other
excellent resources [Strang, 1993][Kolter, 2008][Petersen et al.,
2008].
